#ifndef __VOICE_H__
#define __VOICE_H__

#include "adc.h"

/* 电池参数结构体 */
//***************************************************************************************************

typedef struct
{
    uint16_t adc_value;		// 低通滤波后的adc采样值
	float adc_v;			// 低通滤波后的adc电压
	float percentage;		// 电池电量百分比
}battery_t;

extern battery_t battery;


//***************************************************************************************************


/* 电池函数声明 */
//***************************************************************************************************

void voice_init(void);                      // 电池测量初始化函数
void voice_get(battery_t *battery);         // 获取当前电池的电压
uint16_t lowV(uint16_t com);                // 一阶低通滤波器

//***************************************************************************************************



#endif