#ifndef __IR_H__
#define __IR_H__

#include "tim.h"


/* 红外参数结构体 */
//***************************************************************************************************

typedef struct 
{
    uint32_t upcount;         // 定时器中断溢出次数
    uint16_t valueup;         // 上升沿计数
    uint16_t valuedown;       // 下降沿计数
    uint8_t  isup_flag;        // 上升沿标志
    uint32_t weigh;           // 脉宽值
    uint16_t buffer[40];     // 数据缓冲区
    uint16_t buffid;          // 缓冲区ID
    uint8_t  recflag;          // 接收标志
    char     num[4];              // 转换为十六进制后的数据包
}ir_t;

extern ir_t ir;

//***************************************************************************************************


/* 红外函数声明 */
//***************************************************************************************************

void Ir_init(void);
void ir_rece(char num[]);

//***************************************************************************************************




#endif
